In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('dirty_cafe_sales.csv')

In [3]:
df

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_1961373,Coffee,2,2.0,4.0,Credit Card,Takeaway,2023-09-08
1,TXN_4977031,Cake,4,3.0,12.0,Cash,In-store,2023-05-16
2,TXN_4271903,Cookie,4,1.0,ERROR,Credit Card,In-store,2023-07-19
3,TXN_7034554,Salad,2,5.0,10.0,UNKNOWN,UNKNOWN,2023-04-27
4,TXN_3160411,Coffee,2,2.0,4.0,Digital Wallet,In-store,2023-06-11
...,...,...,...,...,...,...,...,...
9995,TXN_7672686,Coffee,2,2.0,4.0,NaN,UNKNOWN,2023-08-30
9996,TXN_9659401,NaN,3,NaN,3.0,Digital Wallet,NaN,2023-06-02
9997,TXN_5255387,Coffee,4,2.0,8.0,Digital Wallet,NaN,2023-03-02
9998,TXN_7695629,Cookie,3,NaN,3.0,Digital Wallet,NaN,2023-12-02
9999,TXN_6170729,Sandwich,3,4.0,12.0,Cash,In-store,2023-11-07

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9667 non-null   object
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9821 non-null   object
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: object(8)
memory usage: 625.1+ KB

In [5]:
df["Item"].value_counts()

Item
Juice       1171
Coffee      1165
Salad       1148
Cake        1139
Sandwich    1131
Smoothie    1096
Cookie      1092
Tea         1089
UNKNOWN      344
ERROR        292
Name: count, dtype: int64

In [6]:
df["Item"]=df["Item"].replace("UNKNOWN",np.nan)

In [7]:
df["Item"]=df["Item"].replace("ERROR",np.nan)

In [8]:
df["Location"].value_counts()

Location
Takeaway    3022
In-store    3017
ERROR        358
UNKNOWN      338
Name: count, dtype: int64

In [9]:
df["Location"]=df["Location"].replace("UNKNOWN",np.nan)

In [10]:
df["Location"]=df["Location"].replace("ERROR",np.nan)

In [11]:
df["Payment Method"].value_counts()

Payment Method
Digital Wallet    2291
Credit Card       2273
Cash              2258
ERROR              306
UNKNOWN            293
Name: count, dtype: int64

In [12]:
df["Payment Method"]=df["Payment Method"].replace("UNKNOWN",np.nan)

In [13]:
df["Payment Method"]=df["Payment Method"].replace("ERROR",np.nan)

In [14]:
df["Price Per Unit"].value_counts()

Price Per Unit
3.0        2429
4.0        2331
2.0        1227
5.0        1204
1.0        1143
1.5        1133
ERROR       190
UNKNOWN     164
Name: count, dtype: int64

In [15]:
df["Price Per Unit"]=df["Price Per Unit"].replace("UNKNOWN",np.nan)

In [16]:
df["Price Per Unit"]=df["Price Per Unit"].replace("ERROR",np.nan)

In [17]:
df["Quantity"].value_counts()

Quantity
5          2013
2          1974
4          1863
3          1849
1          1822
UNKNOWN     171
ERROR       170
Name: count, dtype: int64

In [18]:
df["Quantity"]=df["Quantity"].replace("UNKNOWN",np.nan)

In [19]:
df["Quantity"]=df["Quantity"].replace("ERROR",np.nan)

In [20]:
df["Total Spent"].value_counts()

Total Spent
6.0        979
12.0       939
3.0        930
4.0        923
20.0       746
15.0       734
8.0        677
10.0       524
2.0        497
9.0        479
5.0        468
16.0       444
25.0       259
7.5        237
1.0        232
4.5        225
1.5        205
UNKNOWN    165
ERROR      164
Name: count, dtype: int64

In [21]:
df["Total Spent"]=df["Total Spent"].replace("UNKNOWN",np.nan)

In [22]:
df["Total Spent"]=df["Total Spent"].replace("ERROR",np.nan)

In [23]:
df["Transaction Date"].value_counts()

Transaction Date
UNKNOWN       159
ERROR         142
2023-06-16     40
2023-02-06     40
2023-07-21     39
             ...
2023-04-27     15
2023-09-24     15
2023-07-22     14
2023-03-11     14
2023-02-17     14
Name: count, Length: 367, dtype: int64

In [24]:
df["Transaction Date"]=df["Transaction Date"].replace("UNKNOWN",np.nan)

In [25]:
df["Transaction Date"]=df["Transaction Date"].replace("ERROR",np.nan)

In [26]:
df["Transaction Date"]=pd.to_datetime(df["Transaction Date"])

In [27]:
df["Transaction ID"].value_counts()

Transaction ID
TXN_1961373    1
TXN_4831525    1
TXN_1228927    1
TXN_6486912    1
TXN_3447069    1
              ..
TXN_5680238    1
TXN_7766134    1
TXN_2617257    1
TXN_8993132    1
TXN_6170729    1
Name: count, Length: 10000, dtype: int64

In [28]:
df.isna().sum()

Transaction ID         0
Item                 969
Quantity             479
Price Per Unit       533
Total Spent          502
Payment Method      3178
Location            3961
Transaction Date     460
dtype: int64

In [29]:
df=df.sort_values(by = "Transaction Date")

In [30]:
df=df.set_index("Transaction Date")

In [31]:
df

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location
Transaction Date,,,,,,,
2023-01-01,TXN_4801947,Juice,1,3.0,3.0,Digital Wallet,Takeaway
2023-01-01,TXN_9161256,Smoothie,2,4.0,8.0,Digital Wallet,In-store
2023-01-01,TXN_6093955,Tea,5,1.5,NaN,NaN,Takeaway
2023-01-01,TXN_8842223,Sandwich,5,NaN,20.0,Digital Wallet,In-store
2023-01-01,TXN_7367474,Juice,5,3.0,15.0,Digital Wallet,Takeaway
...,...,...,...,...,...,...,...
NaT,TXN_9460419,Cake,1,3.0,3.0,NaN,Takeaway
NaT,TXN_8253472,Cake,1,3.0,3.0,NaN,NaN
NaT,TXN_3130865,Juice,3,3.0,9.0,NaN,In-store
NaT,TXN_9226047,Smoothie,3,4.0,12.0,Cash,NaN
NaT,TXN_9594133,Cake,5,3.0,NaN,NaN,NaN

In [32]:
PPI_dict={'Coffee':2.0,'Tea':1.5,'Sandwich':4.0,'Salad':5.0,'Cake':3.0,'Cookie':1.0,'Smoothie':4.0,'Juice':3.0}

In [33]:
Item_dict={2.0:'Coffee',1.5:'Tea',4.0:'Sandwich',5.0:'Salad',3.0:'Cake',1.0:'Cookie',4.0:'Smoothie',3.0:'Juice'}

In [34]:
df["Price Per Unit"] = df["Item"].map(PPI_dict).fillna(df["Price Per Unit"])

In [35]:
df.isna().sum()

Transaction ID       0
Item               969
Quantity           479
Price Per Unit      54
Total Spent        502
Payment Method    3178
Location          3961
dtype: int64

In [36]:
df['Quantity']=df['Quantity'].astype(float)

In [37]:
df['Price Per Unit']=df['Price Per Unit'].astype(float)

In [38]:
df['Total Spent']=df.apply(
    lambda row: row['Quantity']*row['Price Per Unit']
    if pd.notna(row['Quantity']) and pd.notna(row['Price Per Unit'])
    else None,
    axis = 1
)

In [39]:
df["Item"] = df["Price Per Unit"].map(Item_dict).fillna(df["Item"])

In [40]:
df.isna().sum()

Transaction ID       0
Item                54
Quantity           479
Price Per Unit      54
Total Spent        530
Payment Method    3178
Location          3961
dtype: int64

In [41]:
df['Quantity']=df.apply(
    lambda row: row['Total Spent']/row['Price Per Unit']
    if pd.notna(row['Total Spent']) and pd.notna(row['Price Per Unit'])
    else None,
    axis = 1
)

In [42]:
df.isna().sum()

Transaction ID       0
Item                54
Quantity           530
Price Per Unit      54
Total Spent        530
Payment Method    3178
Location          3961
dtype: int64

In [43]:
columnstodrop=['Payment Method','Location']

In [44]:
df = df.drop(columns = columnstodrop)

In [45]:
df.isna().sum()

Transaction ID      0
Item               54
Quantity          530
Price Per Unit     54
Total Spent       530
dtype: int64

In [46]:
df.describe()

          Quantity  Price Per Unit  Total Spent
count  9470.000000     9946.000000  9470.000000
mean      3.026610        2.947667     8.941235
std       1.419331        1.280653     6.005771
min       1.000000        1.000000     1.000000
25%       2.000000        2.000000     4.000000
50%       3.000000        3.000000     8.000000
75%       4.000000        4.000000    12.000000
max       5.000000        5.000000    25.000000

In [47]:
df = pd.read_csv("NEW.csv")

In [48]:
EmptyTransctionDates=df[df['Transaction Date'].isna()]

In [49]:
EmptyTransctionDates.to_csv('EmptyTransctionDates.csv')

In [50]:
df=df.dropna(subset = ['Quantity'])

In [51]:
df.describe()

        Unnamed: 0     Quantity  Price Per Unit  Total Spent
count  9470.000000  9470.000000     9470.000000  9470.000000
mean   5001.133474     3.026610        2.950106     8.941235
std    2885.433790     1.419331        1.279862     6.005771
min       0.000000     1.000000        1.000000     1.000000
25%    2496.250000     2.000000        2.000000     4.000000
50%    5005.500000     3.000000        3.000000     8.000000
75%    7504.750000     4.000000        4.000000    12.000000
max    9999.000000     5.000000        5.000000    25.000000

In [52]:
missingdates=df[df['Transaction Date'].isna()]

In [53]:
missingdates

,Unnamed: 0,Transaction Date,Transaction ID,Item,Quantity,Price Per Unit,Total Spent
9540,9540,NaN,TXN_3051279,Smoothie,2.0,4.0,8.0
9541,9541,NaN,TXN_7640952,Juice,4.0,3.0,12.0
9542,9542,NaN,TXN_7710508,Cookie,5.0,1.0,5.0
9543,9543,NaN,TXN_2091733,Salad,1.0,5.0,5.0
9544,9544,NaN,TXN_7028009,Juice,4.0,3.0,12.0
...,...,...,...,...,...,...,...
9995,9995,NaN,TXN_9460419,Juice,1.0,3.0,3.0
9996,9996,NaN,TXN_8253472,Juice,1.0,3.0,3.0
9997,9997,NaN,TXN_3130865,Juice,3.0,3.0,9.0
9998,9998,NaN,TXN_9226047,Smoothie,3.0,4.0,12.0
9999,9999,NaN,TXN_9594133,Juice,5.0,3.0,15.0

In [54]:
Start_Date=pd.to_datetime('2023-01-01')

In [55]:
End_Date=pd.to_datetime('2023-12-31')

In [56]:
random_dates=pd.to_datetime(np.random.choice(pd.date_range(Start_Date,End_Date), size = len(missingdates)))

In [57]:
missing_mask = df['Transaction Date'].isna()

In [58]:
df.loc[missing_mask, 'Transaction Date'] = random_dates[:sum(missing_mask)]

In [59]:
df['Transaction Date']=pd.to_datetime(df['Transaction Date'])

In [60]:
df=df.drop(columns = 'Unnamed: 0')

In [61]:
df = df.sort_values(by = 'Transaction Date')

In [62]:
df.isna().sum()

Transaction Date    0
Transaction ID      0
Item                0
Quantity            0
Price Per Unit      0
Total Spent         0
dtype: int64

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9470 entries, 0 to 9525
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction Date  9470 non-null   datetime64[ns]
 1   Transaction ID    9470 non-null   object
 2   Item              9470 non-null   object
 3   Quantity          9470 non-null   float64
 4   Price Per Unit    9470 non-null   float64
 5   Total Spent       9470 non-null   float64
dtypes: datetime64[ns](1), float64(3), object(2)
memory usage: 517.9+ KB

In [68]:
df.to_csv('dirty_cafe_sales-cleaned.csv')